wiki/2016-09-19-我使用了一种直接读取_Jar_中内容.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>我使用了一种直接读取 Jar 中内容</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">我使用了一种直接读取 Jar 中内容</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#java"><div class="category">java</div></a> </div>
<div class="char-counter">2016-09-19</div>
        <div id="content">
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">final</span> <span style="font-weight: bold; text-decoration: underline;">File</span> <span style="font-weight: bold; font-style: italic;">jarFile</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">File</span>([&#31867;&#21517;].<span style="font-weight: bold;">class</span>.getProtectionDomain().getCodeSource().getLocation().getPath()); <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#23450;&#20301;&#31867;&#25152;&#22312;&#30340; Jar &#25991;&#20214;</span>
            <span style="font-weight: bold;">if</span>(jarFile.isFile()) {
                <span style="font-weight: bold;">final</span> <span style="font-weight: bold; text-decoration: underline;">JarFile</span> <span style="font-weight: bold; font-style: italic;">jar</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">JarFile</span>(jarFile);
                <span style="font-weight: bold; text-decoration: underline;">Enumeration</span>&lt;<span style="font-weight: bold; text-decoration: underline;">JarEntry</span>&gt; <span style="font-weight: bold; font-style: italic;">entries</span> = jar.entries();
                <span style="font-weight: bold;">while</span> (entries.hasMoreElements()) {
                    <span style="font-weight: bold; text-decoration: underline;">JarEntry</span> <span style="font-weight: bold; font-style: italic;">entry</span> = entries.nextElement();
                    <span style="font-weight: bold;">if</span> (entry.getName().startsWith(<span style="font-style: italic;">"org/noahx"</span>)) {
                        <span style="font-weight: bold; text-decoration: underline;">InputStream</span> <span style="font-weight: bold; font-style: italic;">entryInputStream</span> = jarFile.getInputStream(entry); <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#36941;&#21382;&#21253;&#20013;&#30340;&#20869;&#23481;&#26469;&#33719;&#24471;&#36164;&#28304;</span>
                    }
                }
                jar.close();
            }

</pre>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
